webservices/exercises/lab04/ws-mc-soapreq.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:wsa="http://www.w3.org/2005/08/addressing"
               xmlns:wsmc="http://docs.oasis-open.org/ws-rx/wsmc/200702"
               xsi:schemaLocation=
"http://schemas.xmlsoap.org/soap/envelope/
http://schemas.xmlsoap.org/soap/envelope/
http://www.w3.org/2005/08/addressing
http://www.w3.org/2006/03/addressing/ws-addr.xsd
http://docs.oasis-open.org/ws-rx/wsmc/200702
http://docs.oasis-open.org/ws-rx/wsmc/200702/wsmc-1.1-schema-200702.xsd">
    <soap:Header>
        <wsa:ReplyTo>
            <wsa:Address>http://docs.oasis-open.org/ws-rx/wsmc/200702/anonymous?id=1234</wsa:Address>
        </wsa:ReplyTo>
    </soap:Header>
    <soap:Body>
        <calc:add xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:calc="http://calculator.me.org/" 
                  xsi:schemaLocation="http://calculator.me.org/ http://localhost:7001/SlowCalculatorApp/CalculatorWSService?xsd=1">
            <i>7</i>
            <j>10</j>
        </calc:add>
    </soap:Body>
</soap:Envelope>