webservice/solutions/lab04/soaprequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <calc:add xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:calc="http://calculator.me.org/" 
                  xsi:schemaLocation="http://calculator.me.org/ http://localhost:7001/CalculatorApp/CalculatorWSService?xsd=1">
            <i>7</i>
            <j>10</j>
        </calc:add>
    </soap:Body>
</soap:Envelope>